{
  "id": "fehl108_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl108",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T17:02:01.660Z",
    "chapter": "The Banyan Tree"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "A. Complete the following sentences.\n\n1. The old banyan tree “did not belong” to grandfather, but only to the boy, because ——————————————————————————\n\n2. The small gray squirrel became friendly when —————————\n\n3. When the boy started to bring him pieces of cake and biscuit, the squirrel ——————————————————————————————\n\n4. In the spring, the banyan tree —————————————–, and —————————————– would come there.\n\n5. The banyan tree served the boy as a —————————————–—–\n\n6. The young boy spent his afternoons in the tree —————————\n\nB. Answer the following questions.\n\n1. “It was to be a battle of champions.”\n\n(i) What qualities did the two champions have? Pick out words and phrases from the paragraph above this line in the text and write them down.\n\nMongoose Cobra\n\n(a) ________________ (a) ________________\n\n(b) ________________ (b) ________________\n\n(c) ________________ (c) ________________\n\n(ii) What did the cobra and the mongoose do, to show their readiness for the fight?\n\n2. Who were the other two spectators? What did they do? (Did they watch, or did they join in the fight?)\n\n3. Read the descriptions below of what the snake did and what the mongoose did. Arrange their actions in the proper order.\n\n(i) ceased to struggle l grabbed the snake by the snout\n\n(ii) tried to mesmerise l dragged the snake into the mongoose the bushes\n\n(iii) coiled itself around l darted away and bit the the mongoose cobra on the back\n\n(iv) struck the crow l pretended to attack the cobra on one side\n\n(v) struck again and l refused to look into the missed snake’s eyes\n\n(vi) struck on the side l sprang aside, jumped in that the mongoose and bit pretended to attack\n\n4. (i) What happened to the crow in the end?\n\n(ii) What did the myna do finally?",
      "pages": ["98", "99", "100"],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. The word ‘round’ usually means a kind of shape. What is its meaning in the story?\n\nB. Find five words in the following paragraph, which are generally associated with trees. But here, they have been used differently. Underline the words.\n\nHari leaves for work at nine every morning. He works in the local branch of the firm of which his uncle is the owner. Hari’s success is really the fruit of his own labour. He is happy, but he has a small problem. The root cause of his problem is a stray dog near his office. The dog welcomes Hari with a loud bark every day.\n\nC. The words in the box are all words that describe movement. Use them to fill in the blanks in the sentences below.\n\ndived gliding sprang darting whipped...back delving\n\n1. When he began to trust me, the squirrel began ————————— into my pockets for morsels of cake.\n\n2. I saw a cobra ——————————— out of a clump of cactus.\n\n3. The snake hissed, his forked tongue ———————— ———— in and out.\n\n4. When the cobra tried to bite it, the mongoose —————————— aside.\n\n5. The snake ——————————— his head ——————————— to strike at the crow.\n\n6. The birds ——————————— at the snake.",
      "pages": ["101", "102"],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking",
      "content": "A. The tree was as old as Dehra Dun itself.\n\nSuppose Dehra Dun is 300 years old. How old is the tree?\n\nB. Use the words in the box to speak about the people and the things below, using as...as or -er than.\n\ntall – taller cold – colder hot – hotter strong – stronger short – shorter\n\n1. Heights: Zeba (155cm) Ruby (150cm) Rani (155cm)\n2. Weight Lifters: Vijay (50kg) Akshay (50kg) Anwar (65kg)\n3. City Temperatures: Shimla (60) Gangtok (60) Srinagar (20)\n4. Lengths: Romi’s pencil (3 inches) Mona’s pencil (5 inches) Raja’s pencil (3 inches)\n5. City Temperatures: Delhi (430) Chennai (390) Nagpur (430)",
      "pages": ["103", "104"],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Writing",
      "content": "A. ‘My Favourite Place’\n\nRead again the paragraphs of the story in which the author describes the banyan tree, and what he used to do there. Is there a place in your house, or in your grandparents’ or uncles’ or aunts’ houses, that you specially like? Write a short paragraph about it.",
      "pages": ["105"],
      "diagrams": []
    }
  ]
}
