{
  "id": "fehl106_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl106",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T16:57:58.665Z",
    "chapter": "Who I Am"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "A. Answer the following questions.\n\n1. Peter’s favourite day of the week is Sunday because —————–———————————————\n——————————————————————————–—\n2. Nasir wants to learn ——————————————\n————————————————————————————\n———————————————————————––––––––\n3. Dolma believes that she can make a good Prime Minister because ———————————\n————————————————————————––—\n———–————–––————––————––————––\n\nB. Write True or False against each of the following statements.\n\n1. Peter is an only child. ——————————\n2. When Serbjit gets angry he shouts at people. ——————————\n3. Nasir lives in the city. ——————————\n4. Radha’s mother enjoys doing things with her. ——————————",
      "pages": ["71", "72"],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Fill in the blanks to name the different kinds of intelligence. One has been done for you.\n\nWhen I enjoy listening to people and solving their problems I use my interpersonal intelligence.\n\n(i) When I enjoy dancing or physical activity, I use my ————————————— intelligence.\n(ii) When I enjoy looking at maps and examining pictures I use my ————————————— intelligence.\n(iii) When I enjoy working with numbers and solving maths problems I use my ————————————— intelligence.\n(iv) When I enjoy telling a story or arguing, I use my ————————————— intelligence.\n\nB. Match the job on the left with its description on the right.\n\n(i) Navigator ————— (a) Advises people what to do about jobs, personal problems, etc.\n(ii) Architect ————— (b) Works in politics, usually by standing for election.\n(iii) Politician ————— (c) Finds and monitors the route to get to a place, or the direction of travel.\n(iv) Engineer ————— (d) Reports on recent news for newspaper, radio, or TV.\n(v) Computer programmer ————— (e) Plans the design of a building, town, or city.\n(vi) Athlete ————— (f) Controls and puts together a programme of music.\n(vii) Disc jockey ————— (g) Works in sports or activities such as running, jumping, etc.\n(viii) Composer ————— (h) Designs and builds things like roads, bridges, or engines.\n(ix) Counsellor ————— (i) Makes up notes to create music.\n(x) Journalist ————— (j) Designs the system by which a computer runs or gives information.",
      "pages": ["72", "73"],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Writing",
      "content": "Write a paragraph about yourself so that people who read it will get to know you better. You could write about yourself from any point of view, or choose one of the following topics.\n\n• What I enjoy doing most\n• What makes me angry\n• What I hate to do\n• What I want to become\n\n(Remember to give a reason or details of what you write about, so that anyone reading it will understand you better.)\n\nAfter you have finished your paragraph affix your photo on the sheet and display it on the wall. Read each other’s paragraphs. Did you understand someone else better after you had read what he/she wrote?",
      "pages": ["73", "74"],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Working with the Poem",
      "content": "A. With your partner, complete the following sentences in your own words using the ideas in the poem.\n\n(i) Do not let a thought shrivel and die because ——————————\n—————————————————————————————––––———————\n(ii) English is a ————————————————————— with words that everyone can play.\n(iii) One has to match ———————————————————————————\n(iv) Words are the ————————————————————— of thought.\n\nB. In groups of four, discuss the following lines and their meanings.\n\n(i) All that you do is match the words\nTo the brightest thoughts in your head\n(ii) For many of the loveliest things\nHave never yet been said\n(iii) And everyone’s longing today to hear\nSome fresh and beautiful thing\n(iv) But only words can free a thought\nFrom its prison behind your eyes.",
      "pages": ["74", "75"],
      "diagrams": []
    }
  ]
}
