{
  "id": "fehl107_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl107",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T17:00:04.539Z",
    "chapter": "Fair Play"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "1. \"Then the situation changed.\" What is being referred to? (2)\n2. When Jumman’s aunt realised that she was not welcome in his house, what arrangement did she suggest? (3)\n3. What was the villagers’ reaction when the aunt explained her case to them? (4)\n4. Why was Jumman happy over Algu’s nomination as head Panch? (6)\n5. \"God lives in the heart of the Panch.\" the aunt said. What did she mean? (6)\n6. What was Algu’s verdict as head Panch? How did Jumman take it? (7, 8)\n7. Algu found himself in a tight spot. What was his problem? (9)\n8. Why was Algu upset over Jumman’s nomination as head Panch? (12, 13)\n9. What was Jumman’s verdict as head Panch? How did Algu take it? (14, 15)\n10. Which of the following sums up the story best?\n   (i) \"I also know that you will not kill your conscience for the sake of friendship.\"\n   (ii) \"Let no one deviate from the path of justice and truth for friendship or enmity.\"\n   (iii) \"The voice of the Panch is the voice of God.\"\n   Give a reason for your choice.",
      "pages": [
        "84"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Replace the italicised portion of each sentence below with a suitable phrase from the box. Make necessary changes, wherever required.\n   look after   swallow   make it up    keep mum    go into\n   ease one’s conscience    as ill luck would have it\n   a tight spot    take chances    my heart sank\n   1. The best way to avoid an unnecessary argument is to remain silent.\n   2. Unfortunately, the train I was trying to catch was cancelled.\n   3. He has been told not to take risks while driving a car through a crowded street.\n   4. The patient needs to be properly taken care of.\n   5. Why don’t the two of you end your quarrel by shaking hands?\n   6. I was in a difficult situation till my friends came to my rescue.\n   7. When I saw a pile of dirty dishes, I felt very disappointed.\n   8. I will examine the matter carefully before commenting on it.\n   9. They criticised him in the meeting but he accepted without protest all the criticism.\n   10. It will free me from worry to know that I had done nothing wrong.\nB. Look at the following phrases and their meanings. Use the phrases to fill in the blanks in the sentences given below.\n   set up — put in place or start\n   set aside — save or keep for a particular purpose\n   set down — write or record\n   set out — start on a journey\n   set in — begin and seem likely to continue\n   1. Why don’t you —————————————  your ideas on paper?\n   2. A fund has been —————————————  for the soldiers’ families.\n   3. We should ————————————— a little money every month.\n   4. You should buy some woollens before winter ——————— .\n   5. They ———————————— on the last stage of their journey.",
      "pages": [
        "85",
        "86"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking and Writing",
      "content": "A. Look at the following picture. One asks a question, the other answers it. Then the answer is noted in a form as shown below.\n   Questions Yes/No Additional Response\n   1. Do you like to meet people? Yes I do, but not always. I do have some close friends, though.\n   2. Do you like the area you live in? No, I don’t. But I have no choice.\nB. Work in small groups. Ask your partner the questions given below. If possible, ask him/her a reason for saying Yes or No. Then tick Yes/No, whichever is proper.\n   1. Do you have a separate room for sleep and study? Yes/No\n   2. Would you prefer to live in a joint family? Yes/No\n   3. Do you get on with people? Yes/No\n   4. Do you like the area you live in? Yes/No\n   5. Do you find the place overcrowded? Yes/No\n   6. Do you use public transport? Yes/No\n   7. Would you like a vehicle of our own? Yes/No\n   8. Do you like reading? Yes/No\n   9. Would you like to be a teacher/doctor/engineer/architect? Yes/No\nC. Now that you have completed the above project, write a brief report stating what you did, how you did it and the conclusion.",
      "pages": [
        "87"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Working with the Poem",
      "content": "1. Your partner and you may now be able to answer these questions.\n   (i) Who is the speaker in the poem? Who are the people the speaker meets? What are they doing?\n   (ii) What wishes does the child in the poem make? Why does the child want to be a hawker, a gardener, or a watchman? Pick out the lines in each stanza, which tell us this.\n   (iii) From the way the child envies the hawker, the gardener and the watchman, we can guess that there are many things the child has to do, or must not do.\n   Make a list of the do’s and don’ts that the child doesn’t like. The first line is done for you.\n   The child must The child must not\n   come home at a fixed time. get his clothes dirty in the dust.\n   Now add to the list your own complaints about the things you have to do, or must not do.\n   (iv) Like the child in the poem, you perhaps have your own wishes for yourself. Talk to your friend, using “I wish I were…”\n2. Find out the different kinds of work done by the people in your neighbourhood. Make different cards for different kinds of work. You can make the card colourful with pictures of the persons doing the work.",
      "pages": [
        "89",
        "90"
      ],
      "diagrams": []
    }
  ]
}