{
  "id": "fehl104_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl104",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T16:22:01.918Z",
    "chapter": "An Indian – American Woman in Space: Kalpana Chawla & Beauty"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "A. Answer the following questions:\n\n1. Where was Kalpana Chawla born? Why is she called an Indian – American? (3)\n\n2. When and why did she go to the U.S.? Who did she marry? (2, 3)\n\n3. How did she become an astronaut? What gave her the idea that she could be an astronaut? (3)\n\n4. What abilities must an astronaut have, according to the journalist? (6)\n\n5. Describe Kalpana Chawla’s first mission in space. (5)\n\n6. What does Kalpana Chawla say about pursuing a dream? Do you agree with her that success is possible? (7)",
      "pages": ["48", "49"],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Read the newspaper report to find the following facts about the Columbia’s ill-fated voyage:\n\n1. Date and place of lift off: ————————————————————\n\n2. Number of astronauts on board: ———————————————––\n\n3. Number of days it stayed in space: ——————————————––\n\n4. Number of experiments done by scientists: —————————––\n\n5. Date of return journey: ———————————————–————–––\n\n6. Height at which it lost contact: ————————————————––\n\nB. Match the following:\n\n1. unprecedented space tragedy —— something that causes feelings of respect and wonder\n\n2. certified flight instructor —— having knowledge of a wide variety of subjects\n\n3. space mission —— a set of jobs to be done in space by a group\n\n4. super specialisation —— great expertise in a limited field or a particular subject\n\n5. encyclopaedic knowledge —— a person with the correct qualification to teach people to fly planes\n\n6. awe-inspiring —— a sad accident of a kind that has never happened before in space\n\n7. in this age —— nowadays, in these times\n\nC. Use these phrases in sentences of your own:\n\n1. broke apart  4. lifted off  7. cheered along\n\n2. streaked over  5. blast off  8. on board\n\n3. spread across  6. went on  9. carry on\n\nD. Make opposites using ‘un-’:\n\n1. identified ————————— 6. educated ——————––———\n\n2. controlled ——————–—–– 7. interesting ——————––——\n\n3. attended ————————–— 8. qualified —————————––\n\n4. successful ———————–— 9. trained ——————–—–———\n\n5. important ————————— 10. answerable ———–—————",
      "pages": ["49", "50"],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking",
      "content": "In her message to students of her college, Kalpana Chawla said, “May you have the vision to find the path from dreams to success... Wishing you a great journey.”\n\nForm pairs. Use “May you...” and “I wish you/Wishing you” to wish your partner good luck and success in:\n\n(i) a sports event,\n\n(ii) a quiz or a competition, and\n\n(iii) a test or examination.\n\nBe sure to thank your partner when she/he wishes you in turn. You may also look up a telephone directory, or go to a post office, and get a list in English and Hindi of standard phrases that can be sent in greeting telegrams anywhere in India. Discuss which of these you might use, and when. Compare the English and Hindi phrases for expressing good wishes. Do you know such phrases in any other language?",
      "pages": ["51"],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Writing",
      "content": "A. Do you have a ‘dream’, or something you very much wish to do? Write a paragraph saying what you want or wish to do. Then say (in another paragraph) how you think you can make your dream come true.\n\nB. Given below are some words that are spelt differently in British and American English. Fill in the blanks accordingly:\n\nBritish English  ——  American English\n\n1. colour —— ————————\n\n2. ———————— —— labor\n\n3. ———————— —— traveler\n\n4. counsellor —— ————————\n\n5. centre —— ————————\n\n6. ———————— —— theater\n\n7. ———————— —— organize\n\n8. realise —— ————————\n\n9. ———————— —— defense\n\n10. offence —— ————————",
      "pages": ["51"],
      "diagrams": []
    },
    {
      "exerciseNumber": "5",
      "title": "Working with the Poem",
      "content": "### Poem: Beauty\n\nBeauty is seen\nIn the sunlight,\nThe trees, the birds,\nCorn growing and people working\nOr dancing for their harvest.\n\nBeauty is heard\nIn the night,\nWind sighing, rain falling,\nOr a singer chanting\nAnything in earnest.\n\nBeauty is in yourself.\nGood deeds, happy thoughts\nThat repeat themselves\nIn your dreams,\nIn your work,\nAnd even in your rest.\n\n**Questions:**\n\n1. The poet says, “Beauty is heard in …” Can you hear beauty? Add a sound that you think is beautiful to the sounds the poet thinks are beautiful.\n\n2. The poet, Keats, said: *Heard melodies are sweet, But those unheard are sweeter.* What do you think this means? Have you ever ‘heard’ a song in your head, long after the song was sung or played?\n\n3. Read the first and second stanzas of the poem again. Note the following phrases:\n   - corn growing, people working or dancing, wind sighing, rain falling, a singer chanting\n   Can you rewrite the other phrases like this? Why do you think the poet uses the shorter phrases?\n\n4. Find pictures of beautiful things you have seen or heard of.\n\n5. Write a paragraph about beauty. Use your own ideas along with the ideas in the poem.",
      "pages": ["53"],
      "diagrams": []
    }
  ]
}
