{
  "id": "fehl103_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl103",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T11:57:24.302Z",
    "chapter": "Taro's Reward"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "A. Answer the following questions.\n1. Why did Taro run in the direction of the stream? (5)\n2. How did Taro’s father show his happiness after drinking saké?(7)\n3. Why did the waterfall give Taro saké and others water? (12)\n4. Why did the villagers want to drown Taro? (10, 11)\n5. Why did the Emperor reward Taro? (13)\n\nB. Mark the right item.\n1. Taro earned very little money because\n   (i) he didn’t work hard enough.\n   (ii) the villagers didn’t need wood.\n   (iii) the price of wood was very low.\n\n2. Taro decided to earn extra money\n   (i) to live a more comfortable life.\n   (ii) to buy his old father some saké.\n   (iii) to repair the cracks in the hut.\n\n3. The neighbour left Taro’s hut in a hurry because\n   (i) she was delighted with the drink.\n   (ii) she was astonished to hear Taro’s story.\n   (iii) she wanted to tell the whole village about the waterfall.",
      "pages": [
        "32",
        "33"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Strike off the words in the box below that are not suitable.\nTaro wanted to give his old parents everything they needed. This shows that he was …\nthoughtful    hardworking    loving    honest\nconsiderate    trustworthy    efficient   kind\n\nB. 1. “This made Taro sadder than ever.”\n‘This’ refers to\n   (i) a strong wind that began to blow.\n   (ii) Taro’s father’s old age.\n   (iii) Taro’s inability to buy expensive saké for his father.\n\n2. “This, said the emperor, was to encourage all children to honour and obey their parents.”\n‘This’ refers to\n   (i) the most beautiful fountain in the city.\n   (ii) rewarding Taro with gold and giving the fountain his name.\n   (iii) sending for Taro to hear his story.\n\nC. Arrange the words below in pairs that rhyme.\nExample: young – lung\nmoney – sunny\nyoung sad money chop lung last\nwax could bad sound axe wood\nway stop sunny fast round day\n\nD. 1. Fill in the blanks with words from the box.\nlonely    little    hard    young\nthoughtful    delicious    beautiful\n\nA ——————–— woodcutter lived on a ——————–— hillside. He\nwas a  ——————–——— son who worked  ——————–——— but earned\n——————–——— money. One day he saw a ——————–———\nwaterfall hidden behind a rock. He tasted the water and\nfound it ——————–———.",
      "pages": [
        "34"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking and Writing",
      "content": "A. Speak the following sentences clearly but as quickly as you can. Learn them by heart.\n(i) How much wood would a woodchuck chuck if a woodchuck would chuck wood.\n(ii) Betty bought a bit of butter, but the bit of butter was a little bitter so she bought some better butter to make the bitter butter better.\n\nB 1. The story ‘Taro’s Reward’ shows that Taro is thoughtful, hardworking and also wise. Read aloud the parts of story that show these qualities in Taro.\n\n2. (i) Like Patrick in the story ‘Who Did Patrick’s Homework’, Taro is helped by magic. Do you believe in magic? What are the magical things that happen in these stories?\n(ii) Which story do you like better, and why? Do you know such stories in other languages? Discuss these questions in class.\n\n3. Now write a paragraph or two about these two stories, comparing them.",
      "pages": [
        "35"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Dictation",
      "content": "1. Your teacher will speak the words given below. Write against each two new words that rhyme with it.\n1. bed —–———–———— —–———–————\n2. wax —–———–———— —–———–————\n3. fast —–———–———— —–———–————\n4. chop —–———–———— —–———–————\n5. young —–———–———— —–———–————",
      "pages": [
        "36"
      ],
      "diagrams": []
    }
  ]
}