{
  "id": "fehl101_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl101",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T11:52:53.156Z",
    "chapter": "Who Did Patrick’s Homework?"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "Answer the following questions. (Refer to that part of the text whose number is given against the question. This applies to the comprehension questions throughout the book.)\n\n1. What did Patrick think his cat was playing with? What was it really? (2)\n\n2. Why did the little man grant Patrick a wish? (2)\n\n3. What was Patrick’s wish? (3)\n\n4. In what subjects did the little man need help, to do Patrick’s homework? (5,6)\n\n5. How did Patrick help him? (7)\n\n6. Who do you think did Patrick’s homework — the little man, or Patrick himself? Give reasons for your answer. (9, 10)",
      "pages": ["11"],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Fill in the blanks in the sentences below with the words or phrases from the box. (You may not know the meaning of all the words. Look such words up in a dictionary, or ask your teacher.)\n\nout of luck mystery true to his word chores semester between you and me look up\n\n1. Some people find household ————————————— a bore, but I like to help at home.\n\n2. Who stole the diamond is still a ————————————— .\n\n3. This ————————————— we are going to have a class exhibition.\n\n4. ————————————— , the elf began to help Patrick.\n\n5. Can you ————————————— this word in the dictionary?\n\n6. I started early to be on time, but I was ———————————. There was a traffic jam!\n\n7. She says she’s got a lot of books, but ———————————— I think most of them are borrowed.\n\nB. Use the clues given below to complete this crossword puzzle.\n\nAcross\n\n1. very tired\n\n2. had an angry look on the face\n\n3. short trousers\n\n4. a fault in a machine that prevents it from working properly\n\n5. a small and naughty boy-fairy\n\nDown\n\n6. work that must be done everyday, often boring\n\n7. a basket with a lid\n\n8. gave a short, high-pitched cry",
      "pages": ["12"],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking",
      "content": "A. In the story Patrick does difficult things he hates to do, because the elf pretends he needs help. Have you ever done something difficult or frightening, by pretending about it in some way? Tell your classmates about it.\n\nOr\n\nSay what you feel about homework. (The words and phrases in the boxes may help you.) Do you think it is useful, even though you may not like it? Form pairs, and speak to each other.\n\nFor example:\n\nYou may say, “I am not fond of homework.”\n\nYour partner may reply, “But my sister helps me with my lessons at home, and that gives a boost to my marks.”\n\n(not) be fond of (not) take to (not) develop a liking for (not) appeal to (not) be keen on (not) have a taste for\n\nsupport assist with the aid of\n\nhelp be a boon give a boost to",
      "pages": ["13"],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Writing",
      "content": "A. This story has a lot of rhyming words, as a poem does. Can you write out some parts of it like a poem, so that the rhymes come at the end of separate lines?\n\nFor example:\n\nPatrick never did homework. “Too boring,” he said. He played baseball and hockey and Nintendo instead.\n\nB. Look at these sentences.\n\n1. “Too boring,” he said.\n\n2. Cleaned his room, did his chores.\n\nWhen we speak, we often leave out words that can easily be guessed. We do not do this when we write, unless we are trying to write as we speak (as in the story).\n\nSo, if we were to write carefully, we would say:\n\nl “Homework is too boring,” he said.\n\nl He cleaned his room and did his chores.\n\nC. Rewrite the following incomplete sentences carefully, so that the reader does not have to guess what is left out.\n\n1. more and more books\n\n2. too difficult\n\n3. got up late, missed the bus\n\n4. solved the mystery\n\nD. Look at this cartoon by R.K.Laxman. Read the sentence given below the cartoon. Discuss the following questions with your partner.\n\nl What is it about?\n\nl Do you find it funny? If so, why?\n\nl Do you think a cartoon is a serious drawing? Why or why not?",
      "pages": ["14"],
      "diagrams": []
    },
    {
      "exerciseNumber": "5",
      "title": "Working with the Poem",
      "content": "1. Do you agree with what the poet says? Talk to your partner and complete these sentences.\n\n(i) A house is made of —————————————————––——— .\n\n(ii) It has ————————————————————————————— .\n\n(iii) A home is made by —————————————————––——— .\n\n(iv) It has —————————————––——————————————— .\n\n2. Now complete these sentences about your house and home.\n\n(i) My house is —————————————————––———————\n\n—————————————————––—————————————— .\n\n(ii) The best thing about my home is ————————————––——\n\n—————————————————––—————————————— .",
      "pages": ["16"],
      "diagrams": []
    }
  ]
}
