{
  "id": "fehl105_exercises",
  "metadata": {
    "book": "NCERT: Honeysuckle - Textbook in English for Class VI",
    "bookId": "fehl105",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "English",
    "timestamp": "2025-01-16T16:40:39.064Z",
    "chapter": "A Different Kind of School"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Working with the Text",
      "content": "A. Put these sentences from the story in the right order and write them out in a paragraph. Don’t refer to the text.\n\n1. I shall be so glad when today is over.\n2. Having a leg tied up and hopping about on a crutch is almost fun, I guess.\n3. I don’t think I’ll mind being deaf for a day — at least not much.\n4. But being blind is so frightening.\n5. Only you must tell me about things.\n6. Let’s go for a little walk.\n7. The other bad days can’t be half as bad as this.\n\nB. Answer the following questions:\n\n1. Why do you think the writer visited Miss Beam’s school?\n2. What was the ‘game’ that every child in the school had to play?\n3. “Each term every child has one blind day, one lame day…” Complete the line. Which day was the hardest? Why was it the hardest?\n4. What was the purpose of these special days?",
      "pages": ["60", "61"],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Working with Language",
      "content": "A. Match the words and phrases with their meanings in the box below.\n\n1. homesick\n2. practically\n3. it pains me\n4. appreciate\n5. thoughtless\n6. exercise\n7. relief\n8. ghastly\n\nB. Re-word these lines from the story:\n\n1. I had heard a great deal about Miss Beam’s school.\n2. Miss Beam was all that I had expected — middle-aged, full of authority.\n3. I went to the window which overlooked a large garden.\n4. “We cannot bandage the children’s mouths, so they really have to exercise their will-power.”\n\nC. 1. Given below is a page from a dictionary. Look at it carefully and:\n(i) find a word which means the same as ghastly. Write down the word and its two meanings.\n(ii) find a word meaning a part of the school year.\n(iii) find a word that means examination.",
      "pages": ["62"],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Speaking and Writing",
      "content": "A. Make a short list of things you find difficult to do.\n\nFor example:\n- turning a somersault\n- threading a needle\n\nCompare your list with the others’ in the class. Can you explain why you find these things difficult to do?\n\nB. Look at your hands carefully. Now, write down for each finger one action for which that finger is particularly important. For example, the second (or index) finger helps to hold the knife down firmly when cutting.",
      "pages": ["64"],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Working with the Poem",
      "content": "A. Answer these questions:\n\n1. Why does the poet want to know where the teachers go at four o’clock?\n2. What are the things normal people do that the poet talks about?\n3. What does he imagine about:\n   (a) where teachers live?\n   (b) what they do at home?\n   (c) the people with whom they live?\n   (d) their activities when they were children in school?\n4. Why does the poet wonder if teachers also do things that other people do?\n5. How does the poet plan to find out? What will he do once he finds out?\n\nB. What do you think these phrases from the poem mean?\n\n1. punished in the corner\n2. leave their greens",
      "pages": ["66"],
      "diagrams": []
    }
  ]
}
