{
  "id": "fesc103_exercises",
  "metadata": {
    "book": "NCERT: Science - Textbook for Class VI",
    "bookId": "fesc103",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "Science",
    "timestamp": "2025-01-16T10:25:11.751Z",
    "chapter": "Separation of Substances"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Separation of Substances",
      "content": "1. Why do we need to separate different components of a mixture? Give two examples.\n\n2. What is winnowing? Where is it used?\n\n3. How will you separate husk or dirt particles from a given sample of pulses before cooking?\n\n4. What is sieving? Where is it used?\n\n5. How will you separate sand and water from their mixture?\n\n6. Is it possible to separate sugar mixed with wheat flour? If yes, how will you do it?\n\n7. How would you obtain clear water from a sample of muddy water?\n\n8. Fill up the blanks\n\n(a) The method of separating seeds of paddy from its stalks is called ___________.\n\n(b) When milk, cooled after boiling, is poured onto a piece of cloth the cream (malai) is left behind on it. This process of separating cream from milk is an example of ___________.\n\n(c) Salt is obtained from seawater by the process of ___________.\n\n(d) Impurities settled at the bottom when muddy water was kept overnight in a bucket. The clear water was then poured off from the top. The process of separation used in this example is called ___________.\n\n9. True or false?\n\n(a) A mixture of milk and water can be separated by filtration.\n\n(b) A mixture of powdered salt and sugar can be separated by the process of winnowing.",
      "pages": [
        "29",
        "30"
      ],
      "diagrams": [
        {
          "questionNumber": "7",
          "reference": "How would you obtain clear water from a sample of muddy water?",
          "description": "Separating two components of a mixture by sedimentation and decantation",
          "labels": [
            "undissolved material (soil)",
            "mixture (soil + water)"
          ],
          "location": "25"
        }
      ]
    }
  ]
}