{
  "id": "fess108_exercises",
  "metadata": {
    "book": "NCERT: Our Pasts-I - Textbook in History for Class VI",
    "bookId": "fess108",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "History",
    "timestamp": "2025-01-16T10:55:41.805Z",
    "chapter": "Villages, Towns and Trade"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Let's Recall",
      "content": "1. Fill in the blanks:\n(a) __________ was a word used for large landowners in Tamil.\n(b) The gramabhojaka often got his land cultivated by the _________________\n(c) Ploughmen were known as _________________ in Tamil.\n(d) Most grihapatis were ______________ landowners.\n2. Describe the functions of the gramabhojaka. Why do you think he was powerful?\n3. List the craftspersons who would have been present in both villages and cities.",
      "pages": [
        "83"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Choose the correct answer",
      "content": "(a) Punch marked coins were made of:\n1. silver\n2. gold\n3. tin\n4. ivory\n(b) Mathura was an important:\n1. village\n2. port\n3. religious centre\n4. forested area\n(c) Shrenis were associations of:\n1. rulers\n2. craftspersons\n3. farmers\n4. herders",
      "pages": [
        "83"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Let's Discuss",
      "content": "5. Which of the iron tools shown on page 73 would have been important for agriculture? What would the other tools have been used for?\n6. Compare the drainage system in your locality with that of the cities mentioned in the lesson. What similarities and differences do you notice?",
      "pages": [
        "84"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Let's Do",
      "content": "7. If you have seen craftspersons at work, describe in a short paragraph what they do. (Hint: how do they get the raw materials, what kind of equipment do they use, how do they work, what happens to the finished product).\n8. List the functions performed by men and women who live in your city or village. In what ways are these similar to those performed by people who lived in Mathura? In what ways are they different?\n9. List five things that you buy from the market. Which of these are made in the city/village in which you live, and which are brought by traders from other areas?",
      "pages": [
        "84"
      ],
      "diagrams": []
    }
  ]
}