{
  "id": "fess303_exercises",
  "metadata": {
    "book": "NCERT: SOCIAL AND POLITICAL LIFE – I - Textbook for Class VI",
    "bookId": "fess303",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "Civics",
    "timestamp": "2025-01-16T11:44:53.855Z",
    "chapter": "What is Government?"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Activities of the Government",
      "content": "Look at the newspaper headlines above and list the different kinds of activities that the government is reported to be doing in these newspaper headlines.\n1.\n2.\n3.\n4.\nIsn’t this a wide range of activities? What do you think government is? Discuss in class.",
      "pages": [
        "26"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Government Responsibilities",
      "content": "Can you list three things that the government does which have not been mentioned.\n1.\n2.\n3.",
      "pages": [
        "27"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Levels of Government",
      "content": "Exercise: Look at the statements in the column on the left. Can you identify which level they belong to? Place tick marks against the level you consider most appropriate.\n                 Local       State     Central\n\n• The decision of the Government of India to maintain peaceful relations with Russia.\n\n• The decision of the Government of West Bengal on whether to have Board exam in Class 8 for all government schools.\n\n• Introduction of two new trains between Dibrugarh and Kanyakumari.\n\n• The decision to locate a common well in a particular area of the village.\n\n• Decision to construct a big children’s park in Patna.\n\n• The decision of the Government of Haryana to provide free electricity for all farmers.\n\n• Introduction of a new 1000 rupee note.",
      "pages": [
        "33"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Understanding Government",
      "content": "QUESTIONS\n\n1. What do you understand by the word ‘government’? List five ways in which you think the government affects your daily life.\n\n2. Why do you think the government needs to make rules for everyone in the form of laws?\n\n3. Name two essential features of a democratic government.\n\n4. What was the suffrage movement? What did it accomplish?\n\n5. Gandhiji strongly believed that every adult in India should be given the right to vote. However, a few people don’t share his views. They feel that illiterate people, who are mainly poor, should not be given the right to vote. What do you think? Do you think this would be a form of discrimination? Give five points to support your view and share these with the class.",
      "pages": [
        "33"
      ],
      "diagrams": []
    }
  ]
}