{
  "id": "fess107_exercises",
  "metadata": {
    "book": "NCERT: Our Pasts-I - Textbook in History for Class VI",
    "bookId": "fess107",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "History",
    "timestamp": "2025-01-16T10:54:38.547Z",
    "chapter": "From a Kingdom to an Empire"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Let's recall",
      "content": "1. Make a list of the occupations of the people who lived within the Mauryan empire.\n\n2. Complete the following sentences:\n\n   (a) Officials collected __________ from the area under the direct control of the ruler.\n\n   (b) Royal princes often went to the provinces as ______________.\n\n   (c) The Mauryan rulers tried to control _____________ and ______________ which were important for transport.\n\n   (d) People in forested regions provided the Mauryan officials with ____________.\n\n3. State whether true or false:\n\n   (a) Ujjain was the gateway to the north-west.\n\n   (b) Chandragupta’s ideas were written down in the Arthashastra.\n\n   (c) Kalinga was the ancient name of Bengal.\n\n   (d) Most Ashokan inscriptions are in the Brahmi script.",
      "pages": [
        "68",
        "69"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Let's discuss",
      "content": "4. What were the problems that Ashoka wanted to solve by introducing dhamma?\n\n5. What were the means adopted by Ashoka to spread the message of dhamma?\n\n6. Why do you think slaves and servants were ill-treated? Do you think the orders of the emperor would have improved their condition? Give reasons for your answer.",
      "pages": [
        "69"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Let's do",
      "content": "7. Write a short paragraph explaining to Roshan why the lions are shown on our currency notes. List at least one other object on which you see them.\n\n8. Suppose you had the power to inscribe your orders, what four commands would you like to issue?",
      "pages": [
        "69"
      ],
      "diagrams": []
    }
  ]
}