{
  "id": "fess304_exercises",
  "metadata": {
    "book": "NCERT: SOCIAL AND POLITICAL LIFE – I - Textbook for Class VI",
    "bookId": "fess304",
    "curriculum": "CBSE",
    "grade": "6",
    "subject": "Civics",
    "timestamp": "2025-01-16T11:46:38.419Z",
    "chapter": "Panchayati Raj"
  },
  "exercises": [
    {
      "exerciseNumber": "1",
      "title": "Questions",
      "content": "What problem did the villagers in Hardas village face? What did they do to solve this problem?",
      "pages": [
        "40"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "2",
      "title": "Questions",
      "content": "What, in your opinion, is the importance of the Gram Sabha? Do you think all members should attend Gram Sabha meetings? Why?",
      "pages": [
        "40"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "3",
      "title": "Questions",
      "content": "What is the link between a Gram Sabha and a Gram Panchayat?",
      "pages": [
        "40"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "4",
      "title": "Questions",
      "content": "Take an example of any one task done by a Panchayat in your area/nearby rural area and find out the following:\n a. Why it was taken up.\n b. Where the money came from.\n c. Whether or not the work has been completed.",
      "pages": [
        "41"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "5",
      "title": "Questions",
      "content": "What is the difference between a Gram Sabha and a Gram Panchayat?",
      "pages": [
        "41"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "6",
      "title": "Questions",
      "content": "Read the following news item.\nNimone is a village on the Chauphula-Shirur Road. Like many others, this village has also been facing a severe water shortage for the last few months and villagers depend on tankers for all their needs. Bhagvan Mahadeo Lad (35) of this village was beaten with sticks, iron rods and axes by a group of seven men. The incident came to light when some villagers brought a badly injured Lad to hospital for treatment. In the FIR recorded by the police Lad said that he was attacked when he insisted that the water in the tanker must be emptied into the storage tanks constructed as part of the water supply scheme by Nimone Gram Panchayat so that there would be equal distribution of water. However, he alleged that the upper caste men were against this and told him that the tanker water was not meant for the lower castes.\nAdapted from Indian Express, May 1, 2004\n a. Why was Bhagvan beaten?\n b. Do you think that the above is a case of discrimination? Why?",
      "pages": [
        "41"
      ],
      "diagrams": []
    },
    {
      "exerciseNumber": "7",
      "title": "Questions",
      "content": "Find out more about watershed development and how it benefits an area?",
      "pages": [
        "41"
      ],
      "diagrams": []
    }
  ]
}